
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.et-hmc-servicebus-shared-access-key-tf
  * azurerm_key_vault_secret.hmc_to_et_hearings_api_servicebus-connection-string
  * azurerm_servicebus_subscription_rule.topic_filter_rule_et
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription
* Delete
  * azurerm_key_vault_secret.hmc_to_et_hearings_api_s2s_secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.et-hmc-servicebus-shared-access-key-tf will be created
  + resource "azurerm_key_vault_secret" "et-hmc-servicebus-shared-access-key-tf" {
      + content_type            = "secret"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-hearings-api-aat/providers/Microsoft.KeyVault/vaults/et-hearings-api-aat"
      + name                    = "hmc-servicebus-shared-access-key-tf"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "employment-tribunals"
          + "builtFrom"           = "https://github.com/HMCTS/et-hearings-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#et-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Employment Tribunals"
          + "source"              = "Vault /subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-hearings-api-aat/providers/Microsoft.KeyVault/vaults/et-hearings-api-aat"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.hmc_to_et_hearings_api_s2s_secret will be destroyed
  # (because azurerm_key_vault_secret.hmc_to_et_hearings_api_s2s_secret is not in configuration)
  - resource "azurerm_key_vault_secret" "hmc_to_et_hearings_api_s2s_secret" {
      - id                      = "https://et-hearings-api-aat.vault.azure.net/secrets/hmc-servicebus-connection-string/e3e2798086be469b92eb0a07d7332945" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-hearings-api-aat/providers/Microsoft.KeyVault/vaults/et-hearings-api-aat" -> null
      - name                    = "hmc-servicebus-connection-string" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-hearings-api-aat/providers/Microsoft.KeyVault/vaults/et-hearings-api-aat/secrets/hmc-servicebus-connection-string/versions/e3e2798086be469b92eb0a07d7332945" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-hearings-api-aat/providers/Microsoft.KeyVault/vaults/et-hearings-api-aat/secrets/hmc-servicebus-connection-string" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "e3e2798086be469b92eb0a07d7332945" -> null
      - versionless_id          = "https://et-hearings-api-aat.vault.azure.net/secrets/hmc-servicebus-connection-string" -> null
    }

  # azurerm_key_vault_secret.hmc_to_et_hearings_api_servicebus-connection-string will be created
  + resource "azurerm_key_vault_secret" "hmc_to_et_hearings_api_servicebus-connection-string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-hearings-api-aat/providers/Microsoft.KeyVault/vaults/et-hearings-api-aat"
      + name                    = "hmc-servicebus-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_servicebus_subscription_rule.topic_filter_rule_et will be created
  + resource "azurerm_servicebus_subscription_rule" "topic_filter_rule_et" {
      + filter_type                    = "CorrelationFilter"
      + id                             = (known after apply)
      + name                           = "hmc-servicebus-aat-subscription-rule-BHA1"
      + sql_filter_compatibility_level = (known after apply)
      + subscription_id                = (known after apply)

      + correlation_filter {
          + properties = {
              + "hmctsServiceId" = "BHA1"
            }
        }
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "et-hearings-api-aat"
      + target_resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-hearings-api-aat/providers/Microsoft.KeyVault/vaults/et-hearings-api-aat"

      + enabled_log {
          + category = "AuditEvent"

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription will be created
  + resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + dead_lettering_on_message_expiration      = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + enable_batched_operations                 = false
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 10
      + name                                      = "hmc-subs-to-cft-aat"
      + requires_session                          = false
      + status                                    = "Active"
      + topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat"
    }

Plan: 5 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":63,"Program":"tfcmt","SHA1":"","Vars":{}} -->